# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'autojump'
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 's3cmd'
brew 'trash' # Manage the Trash bin

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'node'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'yarn'

# Apps
cask '1password'
cask 'backblaze'
cask 'cleanmymac'
cask 'docker'
cask 'fantastical'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'kaleidoscope'
cask 'mysql-client'
cask 'phpstorm'
cask 'postman'
cask 'private-internet-access'
cask 'rescuetime'
cask 'sequel-pro'
cask 'skype'
cask 'tableplus'
cask 'tower'
cask 'transmit'
cask 'unlox'
cask 'vlc'
cask 'wkhtmltopdf'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-fira-mono'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'WiFi Explorer', id: 494803304
mas 'Bear', id: 1091189122
