# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'curl-ssl'
brew 'git'
brew 'git-ftp'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 's3cmd'
brew 'trash' # Manage the Trash bin

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'php@7.1'
brew 'composer'
brew 'node'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'yarn'
brew 'brew-php-switcher'

# Apps
cask '1password'
cask 'backblaze'
cask 'cleanmymac'
cask 'dbvisualizer'
cask 'docker'
cask 'fantastical'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'kaleidoscope'
cask 'jet' # Used for codeship testing
cask 'mactracker'
cask 'mjml'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'postman'
cask 'private-internet-access'
cask 'rescuetime'
cask 'rocket'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'superduper'
cask 'tableplus'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'tower'
cask 'tripmode'
cask 'transmit'
cask 'unlox'
cask 'vlc'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-derivative-powerline'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'WiFi Explorer', id: 494803304
mas 'Caffeine', id: 411246225
mas 'Bear', id: 1091189122
mas 'Moom', id: 419330170
mas 'Condense', id: 715394237
mas 'Better', id: 1121192229
mas 'Microsoft Remote Desktop', id: 1295203466
